/*
粮肉,美食,布料,矿产,香粉,珠宝,书籍,书法,丹青,文玩,武器,茶具,香具,瓷器,美酒,乐器,毛皮,符咒,毒药,农产,丹药,祭品,肥料
【特殊物品（仓库最末尾）】
[0,线香]，[1,肥料]，
丹药：
[70,美颜丹，魅力+5]，[71,极品美颜丹，魅力+10]，
[168,回魂丹，健康+50]，[68,长寿丹，延年益寿]，[72,极品长寿丹，寿命+5]，[69,极乐丹，心情+50]，
[75,合欢丹，心情+30 概率直接怀孕]，[282,堕胎丹，健康-50 堕胎]，[283,避孕丹，健康-10 避孕三年]，符咒：
[157,一阶符咒，幸运+4]，[158,二阶符咒，幸运+6]，[159,三阶符咒，幸运+8]，[160,四阶符咒，幸运+10]，[161,五阶符咒，幸运+15]，[162,六阶符咒，幸运+20]，
毒药：
[163,番木鳖，健康-50]，[164,乌头，-60]，[165,雷公藤，-70]，[166,断肠草，-80]，[167,鹤顶红，-100]，
【基础物品】粮肉：
[2,粮食]，[3,蔬菜]，[4,肉食]，美食：
[6,奶酪]，[7,果脯]，[8,青梅]，[9,樱桃]，[10,柿子]，[11,枇杷]，[12,桑葚]，[13,桔子]，[14,荔枝]，[15,熊掌]，[66,鱼]，[73,团饼茶]，[284,鸡蛋]，
布料：
[16,麻布]，[17,粗布]，[18,皮革]，[19,素绫]，[20,交织绫]，[21,单罗纱]，[22,四罗纱]，[23,雪缎]，[24,花缎]，[25,云锦]，[26,蜀锦]，[27,筛绢]，[28,天香绢]，
矿产：
[29,黄金]，[30,白银]，[31,青铜]，[32,黑铁]，[33,白锡]，[34,赤汞]，[35,玉石]，[36,硫磺]，[37,硝石]，[38,煤炭]，[39,石灰]，香粉：
[40,石黛]，[41,青雀石黛]，[42,铜黛]，[43,螺子黛]，[44,铅粉]，[45,紫粉]，[46,桃花粉]，[47,胭脂]，[48,乌膏]，[49,泡花露]，[50,蔷薇露]，书法：
[76,无名字轴]，[77,无名碑帖]，[78,名家字轴]，[79,名家碑帖]，[80,传世字轴]，[81,传世碑帖]，丹青：
[82,无名山水画]，[83,无名江山图]，[84,名家山水画]，[85,名家江山图]，[86,传世山水画]，[87,传世江山图]，文玩：
[88,玉圭]，[89,玉碗]，[90,玉瓶]，[91,玉琥]，[92,玉璧]，[93,玉璜]，[94,玉琮]，[95,玉山]，[96,玉璧]，茶具：
[112,提梁壶]，[113,油滴盏]，[114,天目盏]，[115,青瓷盏]，[116,红釉盏]，[117,青瓷壶]，[118,楠木茶盘]，[119,檀木茶盘]，[120,玉壶]，香具：
[121,铜薰球]，[122,铜香炉]，[123,楠木香筒]，[124,金薰球]，[125,檀木香盒]，[126,金香盒]，[127,檀木香筒]，[128,金香炉]，瓷器：
[129,高足碗]，[130,葫芦瓶]，[131,扁瓶]，[132,瓷枕]，[133,琮式瓶]，[134,梅瓶]，[135,凤尾瓶]，美酒：
[136,黄酒]，[137,曲红酒]，[138,菊花酒]，[139,茱萸酒]，[140,竹叶青]，[141,荔枝酒]，[142,桂花酒]，[143,琥珀酒]，乐器：
[144,竹箫]，[145,木笛]，[146,芦笙]，[147,二胡]，[148,琵琶]，[149,月琴]，[150,中瑟]，[151,伏羲琴]，皮毛：
[152,兔皮]，[153,狼皮]，[154,鹿皮]，[155,狐皮]，[156,虎皮]，
农产：
[5,生茶]，[67,棉花]，[74,盐]，珠宝：
女：[51,银笄，+1]，[52,钿花，+2]，[53,花钗，+3]，[54,耳铛，+4]，[55,步摇，+5]，[56,金簪，+6]，[57,华胜，+7]，[58,宫绦，+8]，[59,梳篦，+9]，[60,臂钏，+10]，[61,璎珞，+11]，
男：[62,发钗，+2]，[63,扳指，+4]，[64,玉佩，+6]，[65,带钩，+8]，武器：
[97,竹弓，+2]，[98,木弓，+3]，[99,牛角弓，+4]，[100,木角弓，+5]，[101,木弩，+6]，[102,铜弩，+7]，[103,连弩，+8]，[104,单刀，+4]，[105,朴刀，+5]，[106,鬼头刀，+6]，[107,三尖两刃刀，+7]，[108,三尺剑，+8]，[109,软剑，+9]，[110,七尺剑，+10]，[111,子母剑，+12]，
【书籍】文：
[169,三字经，+1]，[170,弟子规，+1]，[171,千字文，+1]，[172,蒙求，+1]，
[173,广韵，+2]，[174,广雅，+2]，[175,九章，+2]，[176,尔雅，+2]，[177,陵川集，+2]，[178,花间集，+2]，[179,诗品，+3]，[180,文选，+3]，[181,诗经，+3]，[182,尚书，+3]，[183,礼记，+3]，[184,周易，+3]，
[185,春秋，+4]，[186,大学，+4]，[187,中庸，+4]，[188,论语，+4]，[189,孟子，+4]，[190,法言，+4]，[191,潜夫论，+5]，
武：
[192,手搏六篇，+1]，[193,棍棒体式，+1]，[194,麻杈棍谱，+1]，[195,手臂录，+2]，[196,拳术教范，+2]，[197,苌氏武技书，+2]，[198,阴符枪谱，+3]，[199,太极拳经，+3]，[200,马槊谱，+3]，[201,三才图会，+4]，[202,拳经，+4]，[203,射经，+4]，
[204,剑经，+5]，[205,角力记，+5]，[206,耕余剩技，+5]，商：
[207,土商类要，+2]，[208,货殖列传，+2]，
[209,平淮书，+3]，[210,计然书，+3]，[211,贸易赋，+4]，[212,食货志，+4]，
[213,轻重篇，+5]，[214,考工记，+5]，[215,商君书，+6]，[216,陶朱公生意经，+6]， [217,10 商经，+8]，
艺：
[218,琴律发微，+1]，[219,琴声十六法，+1]，[220,唱论，+1]，[221,琴操，+1]，
[222,乐府杂录，+2]，[223,乐章集，+2]，[224,乐府诗集，+2]，[225,乐书要录，+2]，[226,碧鸡漫志，+3]，[227,琴清英，+3]，[228,梅花三弄，+3]，[229,猗兰操，+3]，[230,广陵散，+4]，[231,阳春白雪，+4]，[232,高山流水，+4]，[233,乐记，+4]，
[234,乐经，+5]，[235,琴赋，+5]，[236,溪山琴况，+5]，[237,太古遗音，+5]，计谋：
[238,左传，+1]，[239,史记，+1]， [240,间书，+2]，[241,捭阖，+2]， [242,飞箝，+3]，[243,许和，+3]，[244,揣篇，+4]，[245,苏子，+4]， [246,太白应经，+5]，[247,战国策，+5]，
[248,韩非子，+6]，[249,孙子兵法，+6]， [250,鬼谷子，+7]，技能：
巫：[251,山海经，+1]，[252,符咒秘本，+1]，[253,巫阳古书，+2]，[254,阴山法笈，+2]，[255,鲁班书，+3]，医：[256,脉经，+1]，[260,精匮要略，+1]，[261,神农本草，+1]，[262,本草纲目，+1]，[263,黄帝内经，+2]，相：[264,得器歌，+1]，[265,五官杂论，+1]，[266,听声相形，+2]，[267,永乐百问，+2]，[268,柳庄相法，+3]，卜：[270,紫微斗数，+1]，[271,梅花易数，+1]，[272,神峰通考，+2]，[273,渊海子平，+2]，[274,三命通会，+3]，媚：[275,素女经，+2]，[276,洞玄子，+4]，
工：[277,长物志，+1]，[278,梓人遗制，+1]，[279,齐民要术，+2]，[280,天工开物，+2]，[281,墨经，+3]
*/
export const ItemType = {
    Incense: '0',
    Fertilizer: '1',
    Food: '2',
    Vegetables: '3',
    Meat: '4',
    Bronze: '31',
    Iron: '32',
    Pewter: '33',
    Sulfur: '36',
    Saltpeter: '37'
}

export type ItemType = (typeof ItemType)[keyof typeof ItemType]

export const MemberTalents = {
    '0': '无',
    '1': '文',
    '2': '武',
    '3': '商',
    '4': '艺'
}

export const MemberSkills = {
    '0': '无',
    '1': '巫',
    '2': '医',
    '3': '相',
    '4': '卜',
    '5': '魅',
    '6': '工'
}

export const MemberLikes = {
    '0': '香粉',
    '1': '书法',
    '2': '丹青',
    '3': '文玩',
    '4': '茶具',
    '5': '香具',
    '6': '瓷器',
    '7': '美酒',
    '8': '琴瑟',
    '9': '毛皮'
}

export const MemberNatures = {
    '0': '无',
    '1': '骄傲',
    '2': '刚正',
    '3': '活泼',
    '4': '善良',
    '5': '真诚',
    '6': '洒脱',
    '7': '高冷',
    '8': '自卑',
    '9': '怯懦',
    '10': '腼腆',
    '11': '凶狠',
    '12': '善变',
    '13': '忧郁',
    '14': '多疑'
}

export const MemberStatus = {
    '0': '正常',
    '1': '被贬',
    '2': '游学二个月',
    '3': '杖责',
    '4': '徒刑',
    '5': '流放三千里',
    '6': '流放二千里',
    '7': '流放一千里',
    '8': '流放五百里',
    '9': '斩首',
    '10': '出征',
    '11': '游历剩 1 月',
    '12': '省亲 1 月',
    '13': '离家出走 1 月',
    '14': '闭关著数 1 月',
    '15': '派驻商会',
    '16': '外出为官',
    '17': '写信做工',
    '18': '街头交易',
    '19': '打探消息',
    '20': '散播流言',
    '21': '私人教习',
    '22': '戏台演出',
    '23': '私塾教学',
    '24': '武场教学'
}

export const Ranks = {
    '1': '伯',
    '2': '侯',
    '3': '公'
}
export const LocRanks = {
    '1': '汉阳',
    '2': '左亭',
    '3': '华阳',
    '4': '宛陵',
    '5': '长罗',
    '6': '安成',
    '7': '太末',
    '8': '盐渎',
    '9': '霍人',
    '10': '比苏',
    '11': '新会',
    '12': '越隽'
}

export const Towns = {
    '0': '南郡',
    '1': '三川郡',
    '2': '蜀郡',
    '3': '丹阳郡',
    '4': '陈留郡',
    '5': '长沙郡',
    '6': '会稽郡',
    '7': '广陵郡',
    '8': '太原郡',
    '9': '益州郡',
    '10': '南海郡',
    '11': '云南郡'
}

export const Counties = {
    '0': {
        '0': '临沮',
        '1': '襄樊',
        '2': '宜城',
        '3': '麦城',
        '4': '华容',
        '5': '郢亭',
        '6': '江陵',
        '7': '夷陵'
    },
    '1': {
        '0': '平阳',
        '1': '荥阳',
        '2': '原武',
        '3': '阳武',
        '4': '新郑',
        '5': '宜阳'
    },
    '2': {
        '0': '邛崃',
        '1': '郫县',
        '2': '什邡',
        '3': '绵竹',
        '4': '新都',
        '5': '成都'
    },
    '3': {
        '0': '秣陵',
        '1': '江乘',
        '2': '江宁',
        '3': '溧阳',
        '4': '建邺',
        '5': '永世'
    },
    '4': {
        '0': '长垣',
        '1': '济阳',
        '2': '成武',
        '3': '襄邑',
        '4': '宁陵',
        '5': '封丘'
    },
    '5': {
        '0': '零陵',
        '1': '益阳',
        '2': '湘县',
        '3': '袁州',
        '4': '庐陵',
        '5': '衡山',
        '6': '建宁',
        '7': '桂阳'
    },
    '6': {
        '0': '曲阿',
        '1': '松江',
        '2': '山阴',
        '3': '余暨'
    },
    '7': {
        '0': '平安',
        '1': '射阳',
        '2': '阳江',
        '3': '江都'
    },
    '8': {
        '0': '大陵',
        '1': '晋阳',
        '2': '九原',
        '3': '石城',
        '4': '阳曲',
        '5': '魏榆',
        '6': '孟县',
        '7': '中都'
    },
    '9': {
        '0': '连然',
        '1': '谷昌',
        '2': '同劳',
        '3': '昆泽',
        '4': '滇池',
        '5': '俞元',
        '6': '胜休',
        '7': '南安'
    },
    '10': {
        '0': '四会',
        '1': '阳山',
        '2': '龙川',
        '3': '揭岭',
        '4': '罗阳',
        '5': '善禺'
    },
    '11': {
        '0': '云平',
        '1': '叶榆',
        '2': '永宁',
        '3': '遂久',
        '4': '姑复',
        '5': '蜻陵',
        '6': '弄栋',
        '7': '邪龙'
    }
}
